NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21B020F512IM32.svd
        <register>
          <name>SCALE0</name>
          <description>Scale</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x8002C000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAIN13LSB</name>
              <description>Gain 13 LSBs</description>
              <bitOffset>18</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAIN3MSB</name>
              <description>Gain 3 MSBs</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN011</name>
                  <description>Upper 3 bits of gain = 011 (0.75x)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN100</name>
                  <description>Upper 3 bits of gain = 100 (1.00x)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCHED0</name>
          <description>Scheduling</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000073FF</resetMask>
          <fields>
            <field>
              <name>PRESCALE</name>
              <description>Prescale</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG1</name>
          <description>Configration</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002060</resetValue>
          <resetMask>0x30E770FF</resetMask>
          <fields>
            <field>
              <name>ADCMODE</name>
              <description>ADC Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>High speed mode with a maximum CLK_ADC of 10 MHz.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSRHS</name>
              <description>High Speed OSR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HISPD2</name>
                  <description>High speed over sampling of 2x.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD4</name>
                  <description>High speed over sampling of 4x. </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD8</name>
                  <description>High speed over sampling of 8x.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD16</name>
                  <description>High speed over sampling of 16x.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD32</name>
                  <description>HIgh speed over sampling of 32x.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD64</name>
                  <description>High speed over sampling of 64x.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANALOGGAIN</name>
              <description>Analog Gain</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANAGAIN0P5</name>
                  <description>Analog gain of 0.5x.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANAGAIN1</name>
                  <description>Analog gain of 1x.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANAGAIN2</name>
                  <description>Analog gain of 2x.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANAGAIN3</name>
                  <description>Analog gain of 3x.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANAGAIN4</name>
                  <description>Analog gain of 4x.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Reference Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBGR</name>
                  <description>Internal 1.21 V reference.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF</name>
                  <description>External Reference. (Calibrated for 1.25V nominal.)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDX</name>
                  <description>AVDD (unbuffered)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDX0P8BUF</name>
                  <description>AVDD (buffered) * 0.8</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWOSCOMPL</name>
              <description>Two's Complement</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic: Single ended measurements are reported as unipolar and differential measurements are reported as bipolar.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCEUNIPOLAR</name>
                  <description>Force all measurements to result in unipolar output. Negative differential numbers will saturate to 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCEBIPOLAR</name>
                  <description>Force all measurements to result in bipolar output.  Single ended measurements are half the range, but allow for small negative measurements.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCALE1</name>
          <description>Scale</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0x8002C000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAIN13LSB</name>
              <description>Gain 13 LSBs</description>
              <bitOffset>18</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAIN3MSB</name>
              <description>Gain 3 MSBs</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN011</name>
                  <description>Upper 3 bits of gain = 011 (0.75x)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN100</name>
                  <description>Upper 3 bits of gain = 100 (1.00x)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCHED1</name>
          <description>Scheduling</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000073FF</resetMask>
          <fields>
            <field>
              <name>PRESCALE</name>
              <description>Prescale</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLEFIFOCFG</name>
          <description>Single FIFO Configuration</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x0000013F</resetMask>
          <fields>
            <field>
              <name>ALIGNMENT</name>
              <description>Alignment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIGHT12</name>
                  <description>ID[7:0], SIGN_EXT, DATA[11:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT12</name>
                  <description>DATA[11:0], 000000000000, ID[7:0]</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHOWID</name>
              <description>Show ID</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DVL</name>
              <description>Data Valid Level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID1</name>
                  <description>When 1 entry in the single FIFO is valid, set the SINGLEFIFODVL interrupt and request DMA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID2</name>
                  <description>When 2 entries in the single FIFO are valid, set the SINGLEFIFODVL interrupt and request DMA.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID3</name>
                  <description>When 3 entries in the single FIFO are valid, set the SINGLEFIFODVL interrupt and request DMA.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID4</name>
                  <description>When 4 entries in the single FIFO are valid, set the SINGLEFIFODVL interrupt and request DMA.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAWUFIFOSINGLE</name>
              <description>Single FIFO DMA wakeup.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>While in EM2 or EM3, the DMA controller will not be requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>While in EM2 or EM3, the DMA controller will be requested when the single FIFO reaches its Data Valid Level. [DVL must be set to 0 (VALID1).]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLEFIFODATA</name>
          <description>Read the oldest valid data from the single FIFO and pop the FIFO</description>
          <addressOffset>0x074</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLEFIFOSTAT</name>
          <description>Single FIFO status</description>
          <addressOffset>0x078</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>FIFOREADCNT</name>
              <description>FIFO Read Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLEDATA</name>
          <description>latest single queue conversion data</description>
          <addressOffset>0x07C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCANFIFOCFG</name>
          <description>Scan FIFO Configuration</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x0000013F</resetMask>
          <fields>
            <field>
              <name>ALIGNMENT</name>
              <description>Alignment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIGHT12</name>
                  <description>ID[7:0], SIGN_EXT, DATA[11:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT12</name>
                  <description>DATA[11:0], 000000000000, ID[7:0]</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHOWID</name>
              <description>Show ID</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DVL</name>
              <description>Data Valid Level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID1</name>
                  <description>When 1 entry in the scan FIFO is valid, set the SCANFIFODVL interrupt and request DMA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID2</name>
                  <description>When 2 entries in the scan FIFO are valid, set the SCANFIFODVL interrupt and request DMA.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID3</name>
                  <description>When 3 entries in the scan FIFO are valid, set the SCANFIFODVL interrupt and request DMA.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID4</name>
                  <description>When 4 entries in the scan FIFO are valid, set the SCANFIFODVL interrupt and request DMA.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAWUFIFOSCAN</name>
              <description>Scan FIFO DMA Wakeup</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>While in EM2 or EM3, the DMA controller will not be requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>While in EM2 or EM3, the DMA controller will be requested when the scan FIFO reaches its Data Valid Level. [DVL must be set to 0 (VALID1).]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCANFIFODATA</name>
          <description>Read the oldest valid data from the scan FIFO and pop the FIFO</description>
          <addressOffset>0x084</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCANFIFOSTAT</name>
          <description>Scan FIFO status</description>
          <addressOffset>0x088</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>FIFOREADCNT</name>
              <description>FIFO Read Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCANDATA</name>
          <description>Most recent data data from scan queue conversion</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
