NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21B020F512IM32.svd
        <register>
          <name>CTRL2</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SQITHRESH</name>
              <description>Signal Quality Indicator threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFRCDIS</name>
              <description>Receive FRC disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPINMODE</name>
              <description>Receive pin mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCHRONOUS</name>
                  <description>Detected payload bits are clocked out on DOUT. Only setups with 1 bit per symbol are supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCHRONOUS</name>
                  <description>DOUT is continuously providing the sign of the detected frequency deviation before offset compensation. Only 2/4-FSK is supported.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPINMODE</name>
              <description>Transmit pin mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Pinmode is turned off. Data is gathered from FRC. DOUT/DCLK clocks out transmitted data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNUSED</name>
                  <description>Unused mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCHRONOUS</name>
                  <description>DIN/PRS controls transmitted baud directly. DCLK is set to 0. No support for frame handling nor coding. Only 2-FSK and OOK/ASK can be used.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCHRONOUS</name>
                  <description>DIN/PRS is sampled on the rising edge of DCLK and used as payload. Frame handling and coding is supported. Only setups with 1 bit per symbol is supported.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFILTER</name>
              <description>Datafilter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Datafilter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHORT</name>
                  <description>Short datafilter enabled. 2*RXBRFRAC should be more than 3.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Medium datafilter enabled. 2*RXBRFRAC should be more than 4.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LONG</name>
                  <description>Long datafilter enabled. 2*RXBRFRAC should be more than 5.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN6</name>
                  <description>Datafilter with length 6 enabled. 2*RXBRFRAC should be more than 6.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN7</name>
                  <description>Datafilter with length 7 enabled. 2*RXBRFRAC should be more than 7.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN8</name>
                  <description>Datafilter with length 8 enabled. 2*RXBRFRAC should be more than 8.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN9</name>
                  <description>Datafilter with length 9 enabled. 2*RXBRFRAC should be more than 9.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRDIVA</name>
              <description>Baudrate division factor A</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRDIVB</name>
              <description>Baudrate division factor B</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVMULA</name>
              <description>Deviation multiplication factor A</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVMULB</name>
              <description>Deviation multiplication factor B</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RATESELMODE</name>
              <description>Rate select mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCHANGE</name>
                  <description>No rate change. BRDIVA/DEVMULA is used for entire frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD</name>
                  <description>Change rate for payload. BRDIVA/DEVMULA is used for header and BRDIVB/DEVMULB is used for payload.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRC</name>
                  <description>FRC selects between BRDIVA/DEVMULA and BRDIVB/DEVMULB for each symbol in the payload. Header uses BRDIVA/DEVMULA.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>The configured/detected syncword decides the settings used for the payload. SYNC0 uses BRDIVA/DEVMULA and SYNC1 uses BRDIVB/DEVMULB. Header uses BRDIVA/DEVMULA.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVWEIGHTDIS</name>
              <description>Deviation weighting disable.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASEL</name>
              <description>DMA select.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFT</name>
                  <description>SOFTVAL field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORR</name>
                  <description>CORRVAL field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQOFFEST</name>
                  <description>FREQOFFEST field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POE</name>
                  <description>POE field</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL3</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <resetMask>0xFFFFFF81</resetMask>
          <fields>
            <field>
              <name>PRSDINEN</name>
              <description>DIN PRS enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTDIVMODE</name>
              <description>Antenna Diversity mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANTENNA0</name>
                  <description>Antenna 0 (ANT0=1, ANT1=0) is used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTENNA1</name>
                  <description>Antenna 1 (ANT0=0, ANT1=1) is used</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTSELFIRST</name>
                  <description>Select-First algorithm.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTSELCORR</name>
                  <description>Select-Best algorithm based on correlation value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTSELRSSI</name>
                  <description>Select-Best algorithm based on RSSI value.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTDIVREPEATDIS</name>
              <description>Antenna diversity repeat disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSAMPMODE</name>
              <description>Timing Search Amplitude Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Amplitude is not used during timing search.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Timing detection is disabled for windows where at least one sample is below limit set by TSAMPLIM.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIFF</name>
                  <description>Timing detection is disabled for windows where the difference between samples is higher than the limit set by TSAMPLIM.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPDEL</name>
              <description>Timing Search Amplitude delay</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSAMPLIM</name>
              <description>Timing Search Amplitude limit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL4</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x03000000</resetValue>
          <resetMask>0xBFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISICOMP</name>
              <description>Inter Symbol Interference compensation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVOFFCOMP</name>
              <description>Deviation offset compensation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREDISTGAIN</name>
              <description>Predistortion gain</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREDISTDEB</name>
              <description>Predistortion debounce</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREDISTAVG</name>
              <description>Predistortion Average</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG8</name>
                  <description>Average over 8 samples.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG16</name>
                  <description>Average over 16 samples.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREDISTRST</name>
              <description>Predistortion Reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASECLICKFILT</name>
              <description>Phase click filter</description>
              <bitOffset>15</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTDSSSMODE</name>
              <description>Soft DSSS mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORR0INV</name>
                  <description>Soft value is inverted value of symbol-0 correlation value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRDIFF</name>
                  <description>Soft value is difference between correlation values for symbol-0 and symbol-1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSATLEVEL</name>
              <description>ADC Saturation Level setting</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONS1</name>
                  <description>AGC enters fast loop after first saturation sample.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONS2</name>
                  <description>2 saturation samples required before AGC enters fast loop.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONS4</name>
                  <description>4 saturation samples required before AGC enters fast loop.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONS8</name>
                  <description>8 saturation samples required before AGC enters fast loop.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONS16</name>
                  <description>16 saturation samples required before AGC enters fast loop.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONS32</name>
                  <description>32 saturation samples required before AGC enters fast loop.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONS64</name>
                  <description>64 saturation samples required before AGC enters fast loop.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSATDENS</name>
              <description>ADC Saturation Density setting</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSETPHASEMASKING</name>
              <description>Offset phase masking</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSETPHASESCALING</name>
              <description>Offset phase scaling</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
